Revit 2027 API
BuiltInFailures.SectionViewFailures Class
 Failures about Section.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SectionViewFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SectionViewFailures
Public NotInheritable Class SectionViewFailures
public ref class SectionViewFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SectionViewFailures = class end
The BuiltInFailures.SectionViewFailures type exposes the following members.
Properties
Name | Description
ScopeBoxBehindSection |  Section may not be associated to a scope box which lies behind it.
Top
See Also
Reference
Autodesk.Revit.DB Namespace